  var dayWeek=prompt ('Какой номер сегодняшнего дня недели?');

  var txt="это, к сожалению рабочий день";
  var i=0;

  var days = ["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"];
  
// цифра или число
 if (isNaN(dayWeek)===true) 
  {alert ('Вы просто обязаны ввести число от 1 до 7');}
// нажата ли отмена
  else if (dayWeek===null)
    {alert ('Вы нажали отмена, но зачем?');}
// проверяем диапозон 1-7
  else if (dayWeek<1 || dayWeek>7)
    {alert ('День недели должен быть в диапазоне от 1 до 7. Не так ли?');}
 
else
  
  {
  
  if (dayWeek==6 || dayWeek==7) {txt="Это выходной день";} 
    
  while (dayWeek-1!=i) { i++; }
    alert (days[i]+': '+txt);
    
    
}